davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
	//GlobalState.timeEstimateSample.time = tempTime;
	//GlobalState.timeEstimateSample.date = tempDate;

	GlobalState.lastConditions.lux = 0.0;
	GlobalState.lastConditions.whiteLux = 0.0;
	GlobalState.lastConditions.temp = 0.0;
	GlobalState.lastConditions.humd = 0.0;

	GlobalState.programMode = MODE_RESTING;

	GlobalState.surveyState.surveyID = SURVEY_NONE;
	char temp_string[10] = "  DRAMSAY.";
	strncpy(GlobalState.surveyState.screenText, temp_string, strlen(temp_string)+1);
	GlobalState.surveyState.screenTextLength = strlen(temp_string);
	memset(GlobalState.surveyState.optionArray, 0, sizeof(GlobalState.surveyState.optionArray));
	GlobalState.surveyState.optionArrayLength = 0;

	GlobalState.currentInterval = 0;
	GlobalState.paused = 0;
	GlobalState.demo = 0;
}

static void updateInterval(){
	uint32_t updateVal = rand() % (GlobalState.timeBound.maxInterval - GlobalState.timeBound.minInterval);
	GlobalState.currentInterval = GlobalState.timeBound.minInterval + updateVal;
}



static inline void set_bit(long *x, int bitNum) {
    *x |= (1L << bitNum);
}

static inline void clear_bit(long *x, int bitNum) {
    *x &= (~(1L << bitNum));
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {

	BaseType_t xHigherPriorityTaskWoken = pdFALSE;
	xTaskNotifyFromISR(buttonPressHandle, GPIO_Pin, eSetValueWithOverwrite, &xHigherPriorityTaskWoken);
	portYIELD_FROM_ISR(xHigherPriorityTaskWoken);

}

HAL_StatusTypeDef updateLastSeenTime(){

	HAL_StatusTypeDef status_1, status_2;

    osMutexAcquire(lastSeenMutexHandle, portMAX_DELAY);
    status_1 = HAL_RTC_GetTime(&hrtc, &(GlobalState.lastSeenTime.time), RTC_FORMAT_BCD);
    status_2 = HAL_RTC_GetDate(&hrtc, &(GlobalState.lastSeenTime.date), RTC_FORMAT_BCD);
    osMutexRelease(lastSeenMutexHandle);

    return status_1 | status_2;

}

HAL_StatusTypeDef updateLastSurveyTime(){

	HAL_StatusTypeDef status_1, status_2;

    osMutexAcquire(lastSeenMutexHandle, portMAX_DELAY);
    status_1 = HAL_RTC_GetTime(&hrtc, &(GlobalState.lastSurveyTime.time), RTC_FORMAT_BCD);
    status_2 = HAL_RTC_GetDate(&hrtc, &(GlobalState.lastSurveyTime.date), RTC_FORMAT_BCD);
    osMutexRelease(lastSeenMutexHandle);

    return status_1 | status_2;

}


void get_RTC_hrmin(char *dest) {

    RTC_TimeTypeDef cTime;
    RTC_DateTypeDef cDate;

    osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
    HAL_RTC_GetTime(&hrtc, &cTime, RTC_FORMAT_BCD);
    //must get date as well; RTC shadow registers will error if both aren't accessed
    HAL_RTC_GetDate(&hrtc, &cDate, RTC_FORMAT_BCD);
    osMutexRelease(rtcMutexHandle);

    uint8_t  hrs = RTC_Bcd2ToByte(cTime.Hours);
    uint8_t mins = RTC_Bcd2ToByte(cTime.Minutes);

    char time[5];
    sprintf (time, "%02d%02d", hrs, mins);

    strncpy(dest, time, sizeof(time));

}

void get_RTC_hrminsec(char *dest) {

	RTC_TimeTypeDef cTime;
    RTC_DateTypeDef cDate;


	osMutexAcquire(rtcMutexHandle, portMAX_DELAY);
	HAL_RTC_GetTime(&hrtc, &cTime, RTC_FORMAT_BCD);
	//must get date as well; RTC shadow registers will error if both aren't accessed
	HAL_RTC_GetDate(&hrtc, &cDate, RTC_FORMAT_BCD);
	osMutexRelease(rtcMutexHandle);

	uint8_t  hrs = RTC_Bcd2ToByte(cTime.Hours);
	uint8_t mins = RTC_Bcd2ToByte(cTime.Minutes);
	uint8_t secs = RTC_Bcd2ToByte(cTime.Seconds);

	char time[10];
	sprintf (time, "%02d:%02d:%02d", hrs, mins, secs);

	strncpy(dest, time, sizeof(time));

}

/* USER CODE END 4 */

/* USER CODE BEGIN Header startUIControl */
/**
  * @brief  Function implementing the uiControl thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header startUIControl */
void startUIControl(void *argument)
{
  /* USER CODE BEGIN 5 */
  HAL_GPIO_WritePin(OLED_RESET_GPIO_Port, OLED_RESET_Pin, GPIO_PIN_SET);

  uint8_t oled_buf[WIDTH * HEIGHT / 8];

  er_oled_begin();
  er_oled_clear(oled_buf);
  er_oled_string(0, 10, "  DRAMSAY.", 12, 1, oled_buf);
  er_oled_string(0, 28, "resenv | mit", 12, 1, oled_buf);
  er_oled_display(oled_buf);

  osDelay(3000);

  er_oled_clear(oled_buf);
  er_oled_display(oled_buf);

  int16_t current_minute = -1;
  int16_t display_minute = -1;
  int16_t last_display_minute = -1;
  int16_t minute_history[TOUCH_HISTORY_SIZE] = {0};
  uint8_t history_ind = 0;
  int16_t min_minute, max_minute;
  uint8_t hrs, mins, step, i;
  char time[5];

  uint32_t notification;

  xTaskNotifyStateClear(NULL);

  uint8_t touch_end_count = 0;

  RTC_TimeTypeDef cTime;
  RTC_DateTypeDef cDate;

  BLETX_Queue_t bleSendData;

  //init peripheral (not turbo mode, poll every 250ms, if touch sample at 40Hz until no touch)
  if (setup_iqs263() == HAL_ERROR) {
	  strncpy(errorCondition, "ERR:IQS263ST", sizeof(errorCondition));
	  GlobalState.programMode = MODE_ERROR;
  }

    /* Infinite loop */
    for(;;)
    {

     // -- Adjust/Dial in Angle Mapping for Touch Sensor -- //
     //uint16_t current_angle = iqs263_get_angle();
     //er_oled_clear(oled_buf);
     //sprintf (time, "%d", current_angle);
     //er_oled_string(0, 0, time, 12, 1, oled_buf);
     //er_oled_display(oled_buf);
     // /* comment out when doing angle adjustments

     /*
	 current_minute = iqs263_get_min_if_pressed(); //returns -1 if no press
     if (current_minute != -1) { //touch!

       if (!touch_end_count){ //START TOUCH EVENT!

    	   er_oled_clear(oled_buf);
    	   er_oled_string(0, 0, GlobalState.surveyState.screenText, 12, 1, oled_buf);

    	   if (GlobalState.programMode == MODE_RESTING){
    		   osMutexAcquire(modeMutexHandle, portMAX_DELAY);
    		   GlobalState.programMode = MODE_TIME_ESTIMATE;
    		   osMutexRelease(modeMutexHandle);
    	   }

           //if we're guessing the time, on start of touch we need to grab
           //the hour of the last seen time as a starting point.
           if (GlobalState.programMode == MODE_TIME_ESTIMATE){

                osMutexAcquire(lastSeenMutexHandle, portMAX_DELAY);
                cTime = GlobalState.lastSeenTime.time;
                osMutexRelease(lastSeenMutexHandle);

                hrs = RTC_Bcd2ToByte(cTime.Hours);
                mins = 0x00;
           }

           //on immediate touch set history to current minute
           for (i=0; i < TOUCH_HISTORY_SIZE; i++){
        	   minute_history[i] = current_minute;
           }
       }

