davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
		   }

		   //xTaskNotifyStateClear(NULL);

		   er_oled_clear(oled_buf);
		   er_oled_display(oled_buf);

		   osMutexAcquire(modeMutexHandle, portMAX_DELAY);
		   GlobalState.programMode = MODE_RESTING;
		   osMutexRelease(modeMutexHandle);

		   xTaskNotifyGive(alertHandle);

		   break;

       case MODE_ERROR:
    	   //ERROR condition: print condition and loop forever

    	   er_oled_clear(oled_buf);
    	   er_oled_string(0, 12, errorCondition, 12, 1, oled_buf);
    	   er_oled_display(oled_buf);
    	   for (;;){}
    	   break;

       case MODE_CLEAR:
    	   //Timeout, notify and wait until clear
    	   //show time and restart

		   er_oled_clear(oled_buf);
		   er_oled_string(0, 10, "  Thank you!", 12, 1, oled_buf);
		   er_oled_display(oled_buf);

		   osDelay(500);

		   er_oled_clear(oled_buf);
		   er_oled_display(oled_buf);

		   osMutexAcquire(modeMutexHandle, portMAX_DELAY);
		   GlobalState.programMode = MODE_RESTING;
		   osMutexRelease(modeMutexHandle);

    	   break;


       case MODE_ESM_SURVEY:
       case MODE_TIME_ESTIMATE:
    	  er_oled_clear(oled_buf);
    	  er_oled_string(0, 0, GlobalState.surveyState.screenText, 12, 1, oled_buf);
    	  er_oled_display(oled_buf);
    	  osDelay(100);
    	  break;

       case MODE_RESTING:
		   osDelay(250);
		   if (GlobalState.paused){
			   er_oled_clear(oled_buf);
			   er_oled_string(0, 14, "   paused", 12, 1, oled_buf);
			   er_oled_display(oled_buf);
		   }
		   break;

       default:
    	   osDelay(20);
    	   break;
       }

     }
     // comment out when doing angle adjustments -- */
    //}



  /* USER CODE END startUIControl */
}


uint8_t check_time_bounds(uint8_t curr_hrs){
	//check time bounds, account for wrap (i.e. give time bounds of 10a-3a)

	uint8_t starthr = RTC_Bcd2ToByte(GlobalState.timeBound.startHR_BCD);
	uint8_t endhr = RTC_Bcd2ToByte(GlobalState.timeBound.endHR_BCD);

	if (starthr < endhr){
		return (curr_hrs >= starthr && curr_hrs < endhr);
	} else {
		return (curr_hrs >= starthr || curr_hrs < endhr);
	}

}

/* USER CODE BEGIN Header_startESMMain */
/**
* @brief Function implementing the esmMain thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startESMMain */
void startESMMain(void *argument)
{
  /* USER CODE BEGIN startESMMain */

  uint32_t notification;

  const BLETX_Queue_t bleSendData = {TX_PREVIOUS_INVALID, 0x0000};

  /* Infinite loop */
  for(;;)
  {

	    //set this up so that interaction when watch is touched is:

	    //For Sam:
	    // Touch starts time guess.
	    // Letting go puts it in sends time and puts it in MODE_SHOW_TIME
	    // where it says 'Confirm?' with a 3s timeout
	    // if a button is pressed during MODE_SHOW_TIME, changes to MODE_CLEAR, says thanks, MODE_RESTING
	  	// if not, sends INPUT_INVALID and goes to MODE_RESTING
	    // if a button is pressed during MODE_RESTING, goes to MODE_CANCEL (shows time) and sends TIME_SEEN, back to RESTING


    	//clear UI notification flags
    	xTaskNotifyStateClear(NULL);

    	osMutexAcquire(surveyMutexHandle, portMAX_DELAY);
    	strncpy(GlobalState.surveyState.screenText, " GUESS TIME:", strlen(" GUESS TIME:") + 1);
    	GlobalState.surveyState.screenTextLength = strlen(" GUESS TIME:");
    	GlobalState.surveyState.surveyID = SURVEY_EST_TIME;
    	osMutexRelease(surveyMutexHandle);

    	//wait for notification from UI thread that indicates start of user interaction
    	notification = ulTaskNotifyTake( pdTRUE, portMAX_DELAY);


		//show confirm screen
		osMutexAcquire(modeMutexHandle, portMAX_DELAY);
		GlobalState.programMode = MODE_SHOW_TIME;
		osMutexRelease(modeMutexHandle);

		//(2) Wait for notification from button that indicates confirmed input
		notification = ulTaskNotifyTake( pdTRUE, pdMS_TO_TICKS(3000));

		if (notification){//not timed out, had a confirmed event
			//confirmed, set mode to MODE_CLEAR
			xTaskNotifyGive(uiControlHandle);
			osDelay(500);


		} else{
			//not confirmed, send TX_PREVIOUS_INVALID
			osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

			osMutexAcquire(modeMutexHandle, portMAX_DELAY);
			GlobalState.programMode = MODE_RESTING;
			osMutexRelease(modeMutexHandle);
		}
  }
  /* USER CODE END startESMMain */
}

/* USER CODE BEGIN Header_startButtonPress */
/**
* @brief Function implementing the buttonPress thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startButtonPress */
void startButtonPress(void *argument)
{
  /* USER CODE BEGIN startButtonPress */
  /* Infinite loop */

  //Buttons are PULLED UP and drop to 0 when pressed
  uint8_t buttonState[] = {1, 1, 1};
  uint32_t callingPin = 0x00;
  uint32_t holdValue = 0x00;

  for(;;)
  {
	//wait for rising or falling edge trigger, put calling pin in callingPin
	xTaskNotifyWait(0x00, 0x00, &callingPin, portMAX_DELAY);

	//check state of pin
	GPIO_PinState first_read = HAL_GPIO_ReadPin(GPIOB, callingPin);

	//wait 50ms
    osDelay(50);

    //check again (debounce) to get a good reading
	if (first_read == HAL_GPIO_ReadPin(GPIOB, callingPin)){

		//check that we are actually changing state; the edge trigger should only call
		//when this happens (except during debouncing) so we expect this to be true
		//almost always

		//callingPin can be used as bitmask Pin 5/4/3 give 1000000/10000/1000

		if (callingPin == 0b1000 && !first_read) { //button 1 trigger

				//timeout for release at 6 secs
				holdValue = 0x00;
				xTaskNotifyWait(0b1000, 0x00, &holdValue, pdMS_TO_TICKS(6000));

				if (holdValue > 0x00){
					//released before 6 seconds

				  if (GlobalState.programMode == MODE_SHOW_TIME){
					  xTaskNotifyGive(esmMainHandle);
					  //xTaskNotifyGive(uiControlHandle);
				  } else {
					  osMutexAcquire(modeMutexHandle, portMAX_DELAY);
					  GlobalState.programMode = MODE_CANCEL;
					  osMutexRelease(modeMutexHandle);
				  }

				} else { //took six seconds
					  NVIC_SystemReset();
				}
		}
		if (callingPin == 0b10000 && !first_read) { //button 2 trigger

				//timeout for release at 6 secs
				holdValue = 0x00;
				xTaskNotifyWait(0b10000, 0x00, &holdValue, pdMS_TO_TICKS(6000));

