davidbramsay/watch-stm32-main-development/Watch_V1/Core/Src/main.c
				if (holdValue > 0x00){
					//released before 6 seconds

				  if (GlobalState.programMode == MODE_SHOW_TIME){
					  xTaskNotifyGive(esmMainHandle);
					  //xTaskNotifyGive(uiControlHandle);
				  } else {
					  osMutexAcquire(modeMutexHandle, portMAX_DELAY);
					  GlobalState.programMode = MODE_CANCEL;
					  osMutexRelease(modeMutexHandle);
				  }

				} else { //took six seconds
					  NVIC_SystemReset();
				}
		}
		if (callingPin == 0b100000 && !first_read) { //button 3 trigger

				//timeout for release at 6 secs
		    	holdValue = 0x00;
		    	xTaskNotifyWait(0b100000, 0x00, &holdValue, pdMS_TO_TICKS(6000));

		    	if (holdValue > 0x00){
		    		//released before 6 seconds

		    	  if (GlobalState.programMode == MODE_SHOW_TIME){
					  xTaskNotifyGive(esmMainHandle);
					  //xTaskNotifyGive(uiControlHandle);
				  } else {
					  osMutexAcquire(modeMutexHandle, portMAX_DELAY);
					  GlobalState.programMode = MODE_CANCEL;
					  osMutexRelease(modeMutexHandle);
				  }

		    	} else { //took six seconds
		    		  NVIC_SystemReset();
		    	}
		}

	}

  }
  /* USER CODE END startButtonPress */
}

/* USER CODE BEGIN Header_startAlert */
/**
* @brief Function implementing the alert thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startAlert */
void startAlert(void *argument)
{
  /* USER CODE BEGIN startAlert */

  //xTaskNotifyGive(alertHandle); to alert user with flash and vibration

  //HAL_GPIO_WritePin(VIBRATION_GPIO_Port, VIBRATION_Pin, GPIO_PIN_RESET);

  //Init Vibration Motor PWM Parameters
  int duty_cycle = 79; //0 is off, up to ~80
  htim1.Instance->CCR2 = duty_cycle;

  //Dotstar Init
  DotStar_InitHandle dotstar;
  dotstar.spiHandle = &hspi1;
  dotstar.numLEDs = NUM_PIXELS;
  dotstar.colorOrder = DOTSTAR_BGR;
  Dotstar_Init(&dotstar);

  ds_clear();  //turn off
  ds_show();

  const uint8_t MAX_BRIGHTNESS = 0xAA; //max brightness, 0x01-0xFF

  ds_setBrightness(0);

  osDelay(10000);

  ds_clear();  //turn off
  ds_show();

  osDelay(10000);

  ds_clear();  //turn off
  ds_show();

  uint16_t counter;
  uint32_t color;
  uint8_t r,g,b;
  uint8_t LEDDirection, LEDBrightness;

  /* Infinite loop  */
  for(;;)
  {
	ulTaskNotifyTake( pdTRUE, portMAX_DELAY);
	ds_setBrightness(0);
	ds_clear();
	ds_show();

	/*
	 *
	counter = 0;
	LEDDirection = 0;
	LEDBrightness = 0;

	ulTaskNotifyTake( pdTRUE, portMAX_DELAY);

	//start vibration
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);

	//flash loop
	ds_fill(0xFFFFFF, 0, 12);

	while (counter++ < MAX_BRIGHTNESS*2) {

		ds_setBrightness(LEDBrightness);
		ds_show();

		//increment color intensity
		if (LEDDirection) {LEDBrightness--;}
		else {LEDBrightness++;}

		//if we hit a limit switch color scaling up or down
		if (LEDBrightness == MAX_BRIGHTNESS) {LEDDirection = 1;}
		if (LEDBrightness == 0x00) {LEDDirection = 0;}

		osDelay(pdMS_TO_TICKS(2)); //2ms delay
	}

	//turn off LEDs
	ds_setBrightness(0);
	ds_fill(0x000000, 0, 12);
	ds_show();

	osDelay(pdMS_TO_TICKS(100)); //100ms delay

    //stop vibration
    HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_1);

    //if we're in demo mode, flash some LEDs
    if (GlobalState.demo){

    	counter = 0;
    	r = 0xFF;
    	g = 0xFF;
    	b = 0xFF;

    	ds_setBrightness(MAX_BRIGHTNESS);
    	while(GlobalState.demo) {

    		for (int i=0; i< NUM_PIXELS; i++){

    			if      (i==(counter+2)%12)	{ color = (r  <<16) | (g  <<8) | b; }
    			else if (i==(counter+1)%12) { color = (r/2<<16) | (g/2<<8) | b/2; }
    			else if (i==counter)        { color = (r/4<<16) | (g/4<<8) | b/4; }
    			else 						{ color = 0x000000; }

    			ds_setPixelColor32B(i, color); // 'off' pixel at head
    		}

    		ds_show();
    		r = (r + 11) % 0xFF;
    		g = (g + 13) % 0xFF;
    		b = (b + 17) % 0xFF;
    		counter = (counter+1)%12;
    		osDelay(pdMS_TO_TICKS(50));
    	}

    	//turn off LEDs
		ds_setBrightness(0);
		ds_fill(0x000000, 0, 12);
		ds_show();
    }
    */

  }
  /* USER CODE END startAlert */
}

/* USER CODE BEGIN Header_startConditionsPoll */
/**
* @brief Function implementing the conditionsPoll thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_startConditionsPoll */
void startConditionsPoll(void *argument)
{
	osDelay(500); //let screen start first

	//poll ambient temp, humidity, visible light, white light
	//every 5sec
  	if (veml_Setup(hi2c1, VEML_5S_POLLING) == HAL_ERROR){
  		//error condition
  		strncpy(errorCondition, "ERR:VEML7700", sizeof(errorCondition));
  	    GlobalState.programMode = MODE_ERROR;
  	}

  	osDelay(10);

  	if (si7021_set_config(&hi2c1, SI7021_HEATER_OFF, SI7021_RESOLUTION_RH12_TEMP14) == HAL_ERROR) {
  		//error condition
  		strncpy(errorCondition, "ERR:SI7021CF", sizeof(errorCondition));
  	    GlobalState.programMode = MODE_ERROR;
  	}

  	osDelay(10);

  	if (si7021_set_heater_power(&hi2c1, SI7021_HEATER_POWER_3MA) == HAL_ERROR) {
  		//error condition
  		strncpy(errorCondition, "ERR:SI7021HT", sizeof(errorCondition));
  	    GlobalState.programMode = MODE_ERROR;
  	}

  	float lux;
  	float whiteLux;
  	float humidity;
    float temperature;

    const BLETX_Queue_t bleSendData = {TX_TEMP_HUMD, 0x0000};

  	for (;;){

  		lux = veml_Get_Lux();
    	whiteLux = veml_Get_White_Lux();
    	temperature = si7021_measure_temperature(&hi2c1);
    	humidity = si7021_measure_humidity(&hi2c1);

    	osMutexAcquire(conditionMutexHandle, portMAX_DELAY);
    	GlobalState.lastConditions.lux = lux;
    	GlobalState.lastConditions.whiteLux = whiteLux;
    	GlobalState.lastConditions.temp = temperature;
    	GlobalState.lastConditions.humd = humidity;
    	osMutexRelease(conditionMutexHandle);

		osMessageQueuePut(bleTXqueueHandle, &bleSendData, 0, 0);

    	osDelay(29900);
  	}

/* USER CODE END startConditionsPoll */
}


